package flex_depot;

/*
Создать приложение «Склад».
Основная задача проекта: отображать информацию о приходе/расходе материальных средств с отображением документов,
по которым прибыли/убыли.
Система хранит следующую информацию:
    категория товаров (название категории, описание категории и т. д.);
    накладные (вид операции - приход/расход, товар, количество, дата и т. д.);
    товары, находящиеся на складе, с категорией, названием, описанием, количеством и т.д.;
    журнал прихода/расхода товаров с отображением даты и накладных изменения количества товара;
Приложение должно предоставлять интерфейс для:
    отображения состояния товаров на складе;
    получение всех накладных по типу - приход/расход;
    отображение журнала прихода/расхода за указанную пользователем дату;
    отображение статистики приход/расход за месяц;
    добавление накладной, при этом количество товара должно тоже измениться;
    вывод информации по категориям товаров;
 */

public class Main {
    public static void main(String[] args) {

    }
}
